## Merging data using python

In [4]:
# importing libraries

import pandas as pd
import numpy as np

# creating data set:

data1 = {'id': [1,2,3],'name': ["Saima", "Bushra","Bilal"],
       'age':[22, 20, 15]}
df1 = pd.DataFrame(data1)

data2= {'id': [1,2,3],'city': ["Hamilton","Gujrat","Dubai"],
        'country': ["Canada","Pakistan","UAE"]}

df2 = pd.DataFrame(data2 )

# merge dataframe on id

merged_df = pd.merge(df1,df2,on ='id',how='inner')
merged_df.head()

   id    name  age      city   country
0   1   Saima   22  Hamilton    Canada
1   2  Bushra   20    Gujrat  Pakistan
2   3   Bilal   15     Dubai       UAE

# Data Concatenation in python

In [11]:
data1 = {'Name': ['Afnaan' , 'Junaid','Uswa'], 'Age':[5, 7, 10]}
data2 = {'Name': ['Maheen', 'Zainab','Ishmal'], 'Age':[6, 4, 8]}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

df1.head()

     Name  Age
0  Afnaan    5
1  Junaid    7
2    Uswa   10

In [12]:
df2.head()

     Name  Age
0  Maheen    6
1  Zainab    4
2  Ishmal    8

In [16]:
# concatination of both data sets
concat_rows = pd.concat([df1, df2], axis = 0)

In [17]:
concat_rows.head()

     Name  Age
0  Afnaan    5
1  Junaid    7
2    Uswa   10
0  Maheen    6
1  Zainab    4